portal_vendors/app/controllers/inquiries_controller.rb

  def index
    @document = current_ms_vendor.account_document.present?
  	@tr_rfq = TrRfq.all
---
SELECT [tr_rfqs].* FROM [tr_rfqs]