portal_vendors/app/controllers/tr_rfq_submissions_controller.rb

SELECT [tr_rfq_submissions].* FROM [tr_rfq_submissions]
---
  def index
    @tr_rfq_submissions = TrRfqSubmission.all