vendor_management_systems/app/models/ms_vendor.rb

SELECT  1 AS one FROM [ms_vendor_addresses] WHERE [ms_vendor_addresses].[ms_vendor_id] = @0 AND [ms_vendor_addresses].[address_name] = @1  ORDER BY [ms_vendor_addresses].[id] ASC OFFSET 0 ROWS FETCH NEXT @2 ROWS ONLY  [["ms_vendor_id", 120], ["address_name", "Head Office"], ["LIMIT", 1]]
---
  def city
    addresses = []
    addresses = self.ms_vendor_addresses.where(address_name: 'Head Office')
    addresses = self.ms_vendor_addresses.where(address_name: 'Factory') if addresses.empty?
    addresses = self.ms_vendor_addresses.where(address_name: 'Branch') if addresses.empty?