vendor_management_systems/app/controllers/vendors_controller.rb

  def edit
    @vendor = MsVendor.find(params[:id])
---
SELECT  [ms_vendors].* FROM [ms_vendors] WHERE [ms_vendors].[id] = @0  ORDER BY [ms_vendors].[id] ASC OFFSET 0 ROWS FETCH NEXT @1 ROWS ONLY  [["id", 40], ["LIMIT", 1]]